import type { IChat } from "./types";

const chat:IChat[]=[
  { id:1,
    idUser:'10001_cln',
    massage:'Доброе утро! Что там с моим заказом?',
  },
  {
    id:2,
    idUser:'04_mgr',
    massage:'Здравствуйте Олег! Уточните номер заказа',
  },
  {
    id:3,
    idUser:'10001_cln',
    massage:'А я и сам его не вижу.',
  },
  {
    id:4,
    idUser:'01_adm',
    massage:'Приносим извинения за неудобство, у нас технические работы. ID заказа это тот же самый номер.',
  },
  {
    id:5,
    idUser:'10001_cln',
    massage:'Спасибо! Номер заказа: 125668448_8446511',
  },
  {
    id:6,
    idUser:'01_adm',
    massage:'Ярослав, это твой заказ!!!'
  },
  {
    id:7,
    idUser:'05_mgr',
    massage:'Здравствуйте, завтра будет после обеда!'
  },
  { id:8,
    idUser:'10001_cln',
    massage:'Хорошо, но если не будет - отменяю',
  },
  { id:9,
    idUser:'04_mgr',
    massage:'Ярик блин, опять спишь?',
  },
  { id:10,
    idUser:'02_adm',
    massage:'Тишина в эфире!!!',
  },
  { id:11,
    idUser:'03_mgr',
    massage:'Девочки, не ссорьтесь!',
  },
  { id:12,
    idUser:'02_adm',
    massage:'Ещё один!!!',
  },
  {
    id:13,
    idUser:'10002_cln',
    massage:'А у усилка вот этого (ссылка) выход 4 или 8 ом?'
  },
  {
    id:14,
    idUser:'05_mgr',
    massage:'Сергей, я вам техпаспорт скину на почту.'
  },
  {
    id:13,
    idUser:'10002_cln',
    massage:'Да, можно и так!'
  },
  {
    id:14,
    idUser:'10003_cln',
    massage:'Спасибо большое, всё пришло, всем довольна!!!'
  },
  {
    id:15,
    idUser:'03_mgr',
    massage: 'Мы такие радые! Мы так старались!, не забудьте оставить отзыв))))'
  },
  {
    id:16,
    idUser:'10004_cln',
    massage: 'Что нового?',
  },
  {
    id:17,
    idUser:'04_mgr',
    massage:'У нас всё только новое)))'
  },
  {
    id:18,
    idUser:'10005_cln',
    massage:'Эх!!! Скучно мне, сейчас потрачу кучу денюх)))'
  },
  {
    id:17,
    idUser:'04_mgr',
    massage:'Готова помочь в этом нелёгком деле))) Что-то конкретное?',
  },
  {
    id:18,
    idUser:'10005_cln',
    massage:'Да! Холодильник смотрю',
  },
  {
    id:17,
    idUser:'04_mgr',
    massage:'Обращайтесь с любыми вопросами)))',
  },
  {
    id:18,
    idUser:'1000_1000_01',
    massage:'У вас всё здесь дорого!!'
  },
  {
    id:19,
    idUser:'1000_1000_02',
    massage:'посмотрел - не нашёл(((',
  },
  {
    id:20,
    idUser:'1000_1000_03',
    massage:'А почему скидки не работают?',
  },
  {
    id:21,
    idUser:'03_mgr',
    massage:'Для начала нужно зарегистрироваться и получить статус клиента',
  },
  {
    id:22,
    idUser:'1000_1000_03',
    massage:'По любому развод какой-то!!!',
  },
  {
    id:23,
    idUser:'1000_1000_04',
    massage:'Во все города доставляете?',
  },
  {
    id:24,
    idUser:'04_mgr',
    massage:'по всей России',
  }

]

export default chat
