export const instructionsForEnteringPersonalData:string = `Для просмотра страницы необходимо согласие на обработку персональных данных!!!
    Заполняя иннициалы, используйти только латинские  буквы или кириллицу (ненужно вводить другие 
    символы или цыфры, также не нужно использовать одновременно латиницу и кириллицу)
    Адрес электронной почты должен соответствовать name@domen.zone. Не желательно вводить
    кирилицу и некоторые символы: пробел, !#\$%&~=,'  и более 1 точки (подряд).
    Набирая телефонный номер вводите только цифры (разделяющие знаки вводятся автоматически).
    Не забудьте про согласие на обработку персональных данных.`
export const hiddenText:string='Выдры в гетрах)))' 